""""
Задача 3 - Оценка според брой точки на теста.
Вие сте преподавател и трябва да сложите оценка на всеки тест.

Тъй като имате много тестове да проверявате, искате да напишете програма, която взима крайният брой точки на един тест и казва каква трябва да бъде оценката там.

Във файл grader.py, напишете програма, която да върши работата за вас.

Правилата са следните:

Минималния брой точки е 0
Максималния брой точки е 100
Ако човек има между 0 и 50 точки включително, оценката е "Слаб 2"
Ако човек има между 51 и 60 точки включително, оценката е "Среден 3"
Ако човек има между 61 и 70 точки включително, оценката е "Добър 4"
Ако човек има между 71 и 80 точки включително, оценката е "Много Добър 5"
Ако човек има над 81 точки, оценката е "Отличен 6"
Aко човек има точно 100 точки, оценката е "Много Отличен 7"

"""


n = input('Enter points:')
n = int(n)

if n > 0 and n <= 50:
    print('Слаб 2')
elif n >= 51 and n<= 60:
    print('Среден 3')
elif n >= 61 and n <= 70:
    print('Добър 4')
elif n >= 71 and n <= 80:
    print('Много добър 5')
elif n > 81 and n <= 99:
    print('Отличен 6')
if n == 100:
    print('Много Отличен 7')
