"""Задача 1 - Числата от 1 до N през 2.
Във файла 1_to_n_by_2.py напишете програма, която:

Чете едно число n от потребителя.
Принтира на конзолата всяко второ число, започвайки от 1 и стигайки до n
Например:

При вход n = 5, това са числата 1, 3, 5.
При вход n = 6, това са числата 1, 3, 5.
При вход n = 7, това са числата 1, 3, 5, 7.

"""

n = int(input('Enter number n: '))

start = 1

while start <= n:
    print(start)

    start = start + 2

