"""Задача 14 - Игра на зарове.
На Иван и Мария им било скучно една неделя, при което решили да играят на интересна игра със зарчета.

Правилата са следните:

Всеки от тях взима по общо 5 зарчета, със страни от 1 до 6
На лист хартия всеки записва своето име, под което записва и числото 1001.
Последовалтено - първо Мария, после Иван, всеки хвърля своите 5 зарчета.
Полученият резултат от всяко зарче се сумира и сумата се изважда от неговото число (начало 1001).
Печели този, който първи стигне точно до 0
Ако даден играч е успял да стигне до числото 20 и хвърли зарчета като за 30, то той става на резултат -10.
Ако резултатът на играчът стане отрицателен, то при следващото му хвърляне, сумата на зарчетата се събира към него, вместо да се изважда.
Печели този играч, който първи стигне точно до 0, независимо дали от отрицателната или от положителната страна.
Например, нека имаме, че Иван е на 20 точки, а Мария на 30.

Едно разиграване:

Иван хвърля 5 зарчета по 6, общо 30. Става на -10 точки.
Мария хвърля общо 20 и става на 10 точки.
Второ разиграване:

Иван хвърля 15 и става на +5 точки.
Мария хвърля 10 и става на 0 - печели играта!
В програма dice_1001.py напишете програма, която симулира тази игра, играейки заровете на Иван и Мария.

Програмата ще трябва да отпечатва при всяко хвърляне, колко е сумата от зарчетата и временния резултат за играча.
Когато има победител, програмата трябва да го отпечата и да спре.

"""

