"""Задача 1 - Създаване на списъци на ръка
В REPL на Python, напишете изрази, които представляват:

Списък от числото 1
Списък от числата 1, 2 и 3
Празния списък
Списък от три булеви стойности, носещи истина
Списък от низовете "Python" и "Django"
Списък от три низа, представляващи твоите три имена
Списък от 5 низа, представляващи имена на твои близки или познати
Списък от низове, които представляват имената на всички езици за програмиране, с които си запознат/а

"""

[1]

[1, 2, 3]

[]

[True, True, True]

["Python", "Django"]

["Konstantin", "Nenkov", "Kocev"]

["Kaloqn", "Monika", "Kremena", "Nenko", "Rosen"]

["Python", "HTML", "Haskel", "C++", "C#", "Ruby"]