"""Задача 3 - Сливане на списъци
Нека да имаме следните списъци:

a = [1, 2, 3]
b = [4, 5, 6]
c = [1]
d = [8, 8, 10]
Напишете изрази, които:

Сливат всичи списъци, като крайният резултат трябва да е [1, 4, 5, 6, 1, 2, 3, 8, 8, 10]
Сливат списъците a с b
Сливат списъците c с d
Сливат списъка a с a

"""

a = [1, 2, 3]
b = [4, 5, 6]
c = [1]
d = [8, 8, 10]

# 1.

sum = c + b + a + d
print(sum)


# 2.

sum1 = a + b
print(sum1)


# 3.

sum2 = c + d
print(sum2)


# 4.

sum3 = a + a
print(sum3)