"""Задача 2 - От число в списък от цифри. И после обратното.
Във файл digits.py, напишете програма, която:

Чете едно цяло число n от потребителя.
Превръща числото в списък от неговите цифри (започвайки от първата)
Изкарва на екрана получения списък
След което от списъка с цифри, отново получава числото n
Изкарва полученият резултат на екрана
Идеята на задачата е да напишем двете превръщания:

число -> списък от цифри
списък от цифри -> число
Алгоритъм за число -> списък от цифри

Започваме с празен списък digits = []
Докато числото n не стане равно на 0
Взимаме поредната последна цифра digit = n % 10
Добавяме тази цифра в началото на списъка: digits = [digit] + digits
Режем последната цифра: n = n // 10
Накрая в digits имаме нужния резултат.
Алгоритъм за списък от цифри -> число

Започваме с променлива, в която ще държим числото n = 0
За всяка цифра digit от списъка
Казваме, че n = n * 10 + digit
Накрая в n имаме полученото число, от списъка от цифри
Важно е при втората операция да напишете алгоритъма, който ползва списъка от цифри, а не просто да отпечатате числото n

Например:

Enter number n: 10123
List of digits is: [1, 0, 1, 2, 3]
Number is: 10123

"""

"""Чете едно цяло число n от потребителя.
Превръща числото в списък от неговите цифри (започвайки от първата)
Изкарва на екрана получения списък
След което от списъка с цифри, отново получава числото n
Изкарва полученият резултат на екрана
Идеята на задачата е да напишем двете превръщания:

число -> списък от цифри
списък от цифри -> число
Алгоритъм за число -> списък от цифри"""

n = int(input('Enter number: '))

num_list = []
counter = 1

while counter <= 1:
    num_list += [n]
    counter += 1

print(num_list)

number = 0

for i in num_list:
    number += i

print(i)
