"""Задача 12 - Дали число е просто
Във файл is_prime.py, напишете програма, която:

Чете едно цяло число n от потребителя
Изкарва на екрана съобщение, ако числото е просто - The number is prime!
Иначе изкарва съобщение - The number is not prime!
Едно число е просто, ако се дели само на себе си и на 1.

Примери за прости числа са - 2, 3, 5, 7, 11, 13, 2473 и други. Тук може да намерите списък с прости числа

Подсказка

Какво ще стане, ако разделите целочислено, числото 1 на което и да е друго по-голямо от него число?

"""

number = int(input('Enter number: '))

if number % 2 == 0:
    print('The number ' + str(number) + ' is not prime.')
else:
    print('The number ' + str(number) + ' is prime.')