"""Задача 10 - Обръщане на число
Във файл reverse_int.py, напишете програма, която:

Чете едно цяло число n от потребителя
На екрана извежда числото n, записано в обратен ред на своите цифри.
Например:

Ако n = 123, то резултатът е 321
Ако n = 1230, то резултатът пак е 321 - крайните 0 не ги броим.

"""

n = int(input('Enter number: '))

num1 = n % 10
n = n // 10

num2 = n % 10
n = n // 10

num3 = n % 10
n = n // 10

if (num1 == 0 and num2 == 0) or num3 == 0:
    print('Not allowed 0 in the number!')
else:
    print(str(num1) + str(num2) + str(num3))